# SpaceTypeGbxml Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceTypeGbxml Property
ParameterTypeId Class See Also
---
"Space Type (gbXML)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceTypeGbxml { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceTypeGbxml As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceTypeGbxml {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace